#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ActivityBrowserTile

#include "Basic.hpp"


namespace SDK::Params
{

// Function ActivityBrowserTile.ActivityBrowserTile_C.Set Enabled
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserTile_C_Set_Enabled final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ActivityBrowserTile.ActivityBrowserTile_C.Set Disabled
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserTile_C_Set_Disabled final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ActivityBrowserTile.ActivityBrowserTile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ActivityBrowserTile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ActivityBrowserTile.ActivityBrowserTile_C.ExecuteUbergraph_ActivityBrowserTile
// 0x0008 (0x0008 - 0x0000)
struct ActivityBrowserTile_C_ExecuteUbergraph_ActivityBrowserTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

