#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaCustomizationPicker

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.OnNoItemsAvailableInFilter
// 0x0018 (0x0018 - 0x0000)
struct AthenaCustomizationPicker_C_OnNoItemsAvailableInFilter final
{
public:
	class FText                                   EmptyDisplayText;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function AthenaCustomizationPicker.AthenaCustomizationPicker_C.ExecuteUbergraph_AthenaCustomizationPicker
// 0x0038 (0x0038 - 0x0000)
struct AthenaCustomizationPicker_C_ExecuteUbergraph_AthenaCustomizationPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_GetQualifiedFilterDisplayName_ReturnValue; // 0x0008(0x0018)()
	class FText                                   K2Node_Event_EmptyDisplayText;                     // 0x0020(0x0018)(ConstParm)
};

}

