#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Athena_VehicleSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_VehicleSpawner.Athena_VehicleSpawner_C
// 0x0048 (0x0288 - 0x0240)
class AAthena_VehicleSpawner_C : public AFortAthenaVehicleSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 PreviewSkelMesh;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaVehicle*                     SpawnedVehicle;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          YAxisForward;                                      // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FScalableFloat                         ShouldSpawnOstrich;                                // 0x0268(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SpawnVehicle();
	void ExecuteUbergraph_Athena_VehicleSpawner(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_VehicleSpawner_C">();
	}
	static class AAthena_VehicleSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_VehicleSpawner_C>();
	}
};

}

