#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_AthenaPlayerMarker_WithCustomization

#include "Basic.hpp"

#include "B_AthenaMapMarkerBase_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_AthenaPlayerMarker_WithCustomization.B_AthenaPlayerMarker_WithCustomization_C
// 0x0050 (0x0510 - 0x04C0)
class AB_AthenaPlayerMarker_WithCustomization_C final : public AB_AthenaMapMarkerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_AthenaPlayerMarker_WithCustomization_C; // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 TopperClass;                                       // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMapMarkerTopperActor*              TopperInstance;                                    // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             TopperTransform;                                   // 0x04E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_AthenaPlayerMarker_WithCustomization(int32 EntryPoint);
	void UpdateTopper();
	void OnMarkerHidden();
	void OnLoaded_8A042AD24DC8A8C0E9D8E0B4BF3B6C37(class UClass* Loaded);
	void OnMarkerPlaced();
	void OnSetupMarker(const struct FFortWorldMarkerData& MarkerData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_AthenaPlayerMarker_WithCustomization_C">();
	}
	static class AB_AthenaPlayerMarker_WithCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_AthenaPlayerMarker_WithCustomization_C>();
	}
};

}

