#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_BadgerGrape_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_BadgerGrape_Athena.B_BadgerGrape_Athena_C.ExecuteUbergraph_B_BadgerGrape_Athena
// 0x0058 (0x0058 - 0x0000)
struct B_BadgerGrape_Athena_C_ExecuteUbergraph_B_BadgerGrape_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FPrimaryAssetId>                K2Node_MakeArray_Array_1;                          // 0x0028(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UAsyncActionChangePrimaryAssetBundles*  CallFunc_AsyncChangeBundleStateForPrimaryAssetList_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

