#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_ToyBasketball_Base

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_PlayerSpawnedBall_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_ToyBasketball_Base.B_ToyBasketball_Base_C
// 0x0058 (0x0900 - 0x08A8)
class AB_ToyBasketball_Base_C final : public AB_PlayerSpawnedBall_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_ToyBasketball_Base_C;             // 0x08A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Emote_BasketBall_Trail;                          // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LerpIntoGoalTimeline_Scale_7364CBE944F21B3066D27EBD324A1DA9; // 0x08B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpIntoGoalTimeline_Position_7364CBE944F21B3066D27EBD324A1DA9; // 0x08BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LerpIntoGoalTimeline__Direction_7364CBE944F21B3066D27EBD324A1DA9; // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     LerpIntoGoalTimeline;                              // 0x08C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   CuesForScoreValues;                                // 0x08D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         BallSerialNumber;                                  // 0x08E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IdealLerpStartPos;                                 // 0x08E4(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IdealLerpEndPos;                                   // 0x08F0(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         LerpDuration;                                      // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnRep_IdealLerpEndPos();
	void PlayScoringCueAndDestruct(int32 ScoreAmount, const struct FVector& TargetStartPos, const struct FVector& TargetEndPos);
	void LerpIntoGoalTimeline__FinishedFunc();
	void LerpIntoGoalTimeline__UpdateFunc();
	void InitializeToyInstance(class AFortPlayerController* OwningPC, int32 NumTimesSummoned);
	void PlayScoringAnim();
	void ExecuteUbergraph_B_ToyBasketball_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_ToyBasketball_Base_C">();
	}
	static class AB_ToyBasketball_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_ToyBasketball_Base_C>();
	}
};

}

