#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_AssaultRifle_FrontClip_SideAction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_AssaultRifle_FrontClip_SideAction.BP_AssaultRifle_FrontClip_SideAction_C
// 0x00A0 (0x0308 - 0x0268)
class UBP_AssaultRifle_FrontClip_SideAction_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_BA9A03134DBA089D49100DBE71EF86F5; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4E27AC5C48BE291AEB818BA0DAEA04EB; // 0x02A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_B63DE5144515FA5CE71B26B8581D7149; // 0x02F0(0x0018)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_BP_AssaultRifle_FrontClip_SideAction(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AssaultRifle_FrontClip_SideAction_C">();
	}
	static class UBP_AssaultRifle_FrontClip_SideAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AssaultRifle_FrontClip_SideAction_C>();
	}
};

}

