#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Bush_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bush_Prop_AnimBP.Bush_Prop_AnimBP_C
// 0x00A0 (0x0308 - 0x0268)
class UBush_Prop_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_EE5ED2D945FD5514B88BF98B77E08C6A; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E53F6986413B8C68DCEE24B2C89E608D; // 0x02A8(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5381A7F34597C5AABF71E1A171C0D63C; // 0x02F0(0x0018)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Bush_Prop_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bush_Prop_AnimBP_C">();
	}
	static class UBush_Prop_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBush_Prop_AnimBP_C>();
	}
};

}

