#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ChallengeDetailsImageGrid

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeDetailsImageGrid.ChallengeDetailsImageGrid_C
// 0x0020 (0x0300 - 0x02E0)
class UChallengeDetailsImageGrid_C final : public UAthenaChallengeDetailImageGrid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        RolloutLoop;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RolloutStartTime;                                  // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RolloutDuration;                                   // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRevealRollout;                                   // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnLockedToOwnedTransitions(int32 Count, float TimeOffset, float AdditionalTime);
	void Rollout_Tick();
	void Start_Rollout_Tick(float Time);
	void Stop_Rollout_Tick();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnOwnedToCompleteTransitions(int32 Count, float TimeOffset, float AdditionalTime);
	void Rollout_Sound_Failsafe();
	void ExecuteUbergraph_ChallengeDetailsImageGrid(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeDetailsImageGrid_C">();
	}
	static class UChallengeDetailsImageGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeDetailsImageGrid_C>();
	}
};

}

