#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_Med_Soldier_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_Med_Soldier_01_Skeleton_AnimBP.F_Med_Soldier_01_Skeleton_AnimBP_C
// 0x10C8 (0x14B0 - 0x03E8)
class UF_Med_Soldier_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_890FCD7B4F0BC2EEEACB239A83BE5515; // 0x0400(0x0440)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D20022EC456996650C5FAABD9F94D5EE; // 0x0840(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4BCC3F7145A9FA4683D5FE9E44B0F767; // 0x0860(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_FAD98FF0469710A7BDE0EDBF8A706451; // 0x0880(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_731F596B47445FF9472B5097E71E411C; // 0x09C0(0x0030)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_56F62F3B493C77E730A7C0A4F1892259; // 0x09F0(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_ABE53C3B430A76D8943BC99613D595E7; // 0x0E30(0x0108)()
	uint8                                         Pad_F38[0x8];                                      // 0x0F38(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_F22D4D5B46C1E592FF9EE3BB4D57BF8C; // 0x0F40(0x0560)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x14A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_Med_Soldier_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_Med_Soldier_01_Skeleton_AnimBP_C">();
	}
	static class UF_Med_Soldier_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_Med_Soldier_01_Skeleton_AnimBP_C>();
	}
};

}

