#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP.F_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP_C
// 0x2690 (0x2AF0 - 0x0460)
class UF_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance_StrawberryPilotFace
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8E64F1D24D1638333B61FA977806DD49; // 0x0468(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_EF0A8F4B40001BB7DF9A7DA4D064E9AE; // 0x0488(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A8A36873464D0010BA2D029240604942; // 0x04A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1C550EE743F0775714E8BD8EA9E909EC; // 0x05B0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_C5B5D5A54285A72E3DE098BA21551987; // 0x06B8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_EA4D611449018F073430E1A4A54853A9; // 0x07C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9677F5DA492DA0DBA8C6A888388B7ED0; // 0x08C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_41915DC1439990D7238304929563123C; // 0x09D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_BDC0437443DD39C04103D28897B3C0E6; // 0x0AD8(0x0108)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_3509146540B4736019196198EFC39379; // 0x0BE0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_0949B8AF47F4AE959D8642923D6B2F1A; // 0x0D20(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_FA7FED994D8391EADD6C54B8FA6130F8; // 0x0E28(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2EC4C74643541FACFC8D4D82DBCF0AAB; // 0x0F30(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_006AF830479F279E45A988ABB6CA96A4; // 0x1038(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root_321769344F9075D22DC38DAAFB7B3672; // 0x1140(0x0030)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4DFF545946EA336C503016ACC126CC7A; // 0x1170(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_C9EECFBD427BA207CF2A9D9A6357B048; // 0x1278(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_01430BA54C5398D2069663AB18CCAFBF; // 0x1380(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_064855B24B545F31B716DA9E175BAB76; // 0x1488(0x00B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F8BB1C7745E49CC124BD82B055788D4A; // 0x1540(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_678F663F48570B51395DDE86A71EA053; // 0x1560(0x0028)()
	uint8                                         Pad_1588[0x8];                                     // 0x1588(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9B1B024E44A5A56489A334B5F2BC3E3F; // 0x1590(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C7E24CD9447A0111BE779AA535D0D680; // 0x19D0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_FEEA8393465C1C1EE14BC7A63E11A4A4; // 0x19F0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_AFB438F24D868063DE58829C04E50E80; // 0x1E30(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9767F5714909B780BDB2A5BE2CB195CC; // 0x2270(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_76F6A71B48F8F2806F4234931BC23D28; // 0x26B0(0x0440)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_StrawberryPilot_LongHair_FaceAcc_AnimBP_C>();
	}
};

}

