#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: F_MED_StrawberryPilot_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_StrawberryPilot_AnimBP.F_MED_StrawberryPilot_AnimBP_C
// 0x4F58 (0x5340 - 0x03E8)
class UF_MED_StrawberryPilot_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_2A9ADE024B6894935837449B907C1C6D; // 0x03F8(0x0140)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1554DFEA4235F2F78426B58FA3BAB6A8; // 0x0538(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_107CF0A94EFC7E0057D207B22E3ECBB9; // 0x0640(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14AEA99048DAB3B7C8BBD8A61B051943; // 0x0748(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9F6197F34578E86F9483A19D39BAE4C5; // 0x0768(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_EF2B89A84842F45F106E5B9CBC4AD4D6; // 0x0788(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_A66E963049C4552B5080BEA448B280B0; // 0x0890(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_EC0EC6B0423BFE76997D5D9076DD532E; // 0x0998(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_C0CFE9E64E00EFBA6D48BB9FDFF32A1F; // 0x0AA0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_52FED1BB4FEC910D61AAEFA07B508D65; // 0x0BA8(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2C658819419057C6BF3EE5804359E1F0; // 0x0CB0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_0F5D914B4D85F53C7196CE9ECA2E0372; // 0x10F0(0x0440)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_72168CA44285EDF1F0890D9DC7C29525; // 0x1530(0x0560)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_CB839616479972825FC7688E8F81A0E7; // 0x1A90(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1254E39640868BF4FB79899DF413EFB2; // 0x1B98(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3D1050254943A86349622D90980B56BE; // 0x1BB8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_047F25D645BFE26CD245BDBAF61C3686; // 0x1BD8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_CE711806468F39A965BB27967552D144; // 0x1BF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A34D227848D82D63A4AE8FB5EB24FD8F; // 0x1C20(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_EE427CFD4D627E3617BAD3BFB31AE5DE; // 0x1C48(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_AE90ED9B49BAF72851F8BA852CA643BB; // 0x1C68(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_DC53D9584F216492A7592CAB6643032E; // 0x1D70(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5D42EA3A45CBD5EF6275A5B4FB9AC2F8; // 0x1E78(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1B7523E4432BB52A29A87BA7C9038083; // 0x1F80(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C4C5A6574546CC138EDB4DBD73A99A50; // 0x2020(0x00B8)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5C6E911149511ABE49CBD8915DD441FA; // 0x20D8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_AD1E2CA5486C9DDAF38B7BB1C1DE06D5; // 0x21E0(0x0108)()
	uint8                                         Pad_22E8[0x8];                                     // 0x22E8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_CAC315A14B89612D94D1558C5EE5EE18; // 0x22F0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6EFD63C14B1A5812EC22A2B5F979F056; // 0x2730(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8EBDEB6F41F7867BB80ED089F5C11B98; // 0x2B70(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9749A1EB424439DC01118E99287ECAF5; // 0x2FB0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_EDFD83EB41A2CB77838AB2A35B575E4F; // 0x33F0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7E0E07A24F5874344434278763A93AA9; // 0x3830(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1477E462416786B28A8EA1AA72244D69; // 0x3C70(0x0440)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6D931D3F423710688719BEB2AC4EC7D5; // 0x40B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8B7935DA4D143417D5842DB12A65EB6B; // 0x41B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D6DBBBE54FA08C91B9F6108D69D249F4; // 0x42C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9A261F774C411DBAF44F4C89F0BC8BEC; // 0x43C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E6BF1DB247F9AFD3C7EB63BEDA983EAC; // 0x44D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_A73654274003B29A6A3F1B8D4908BC5F; // 0x45D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8E80082340DDF1A305E44286FE3A7D2B; // 0x46E0(0x0108)()
	uint8                                         Pad_47E8[0x8];                                     // 0x47E8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_D9589F8243D72E81147376ACA1D81BED; // 0x47F0(0x0560)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8DE29D6F45B36805F9D51AAA6AC61B31; // 0x4D50(0x0108)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_4AE379E84B1C501122EF97BB559BE44B; // 0x4E58(0x0128)()
	struct FAnimNode_PoseDriver                   AnimGraphNode_PoseDriver_880995EC449974D371DA979DAD4314D1; // 0x4F80(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3997B8B54DFDB908CD14309E5DE2B14B; // 0x50A8(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root_E50E35CE42ABCD782A56C0A9C91CD9DC; // 0x51B0(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_78AA56364A0C5CBCB46E95A853FA40A6; // 0x51E0(0x0108)()
	float                                         legSwingDelta_r;                                   // 0x52E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         legSwingDelta_l;                                   // 0x52EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         crouch_rigid_alpha;                                // 0x52F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         crouch_speed_alpha;                                // 0x52F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         move_speed_alpha;                                  // 0x52F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          crouch_moving;                                     // 0x52FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          is_crouching;                                      // 0x52FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52FE[0x2];                                     // 0x52FE(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                jacket_ext_force;                                  // 0x5300(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         armSwingDelta_r;                                   // 0x530C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         armSwingDelta_l;                                   // 0x5310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         headSwingDelta;                                    // 0x5314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         headTwist_r;                                       // 0x5318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         headTwist_l;                                       // 0x531C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         armSwing_R_INV;                                    // 0x5320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         targetingINV;                                      // 0x5324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CrouchAlpha;                                       // 0x5328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         crouchAlphaINV;                                    // 0x532C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDBNO;                                            // 0x5330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NotDBNO;                                           // 0x5331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_F_MED_StrawberryPilot_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_StrawberryPilot_AnimBP_AnimGraphNode_ModifyBone_78AA56364A0C5CBCB46E95A853FA40A6();
	void OnEndCrouching();
	void OnBeginCrouching();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_StrawberryPilot_AnimBP_AnimGraphNode_Constraint_3997B8B54DFDB908CD14309E5DE2B14B();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_StrawberryPilot_AnimBP_AnimGraphNode_AnimDynamics_7E0E07A24F5874344434278763A93AA9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_StrawberryPilot_AnimBP_AnimGraphNode_AnimDynamics_9749A1EB424439DC01118E99287ECAF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_StrawberryPilot_AnimBP_AnimGraphNode_AnimDynamics_EDFD83EB41A2CB77838AB2A35B575E4F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_StrawberryPilot_AnimBP_C">();
	}
	static class UF_MED_StrawberryPilot_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_StrawberryPilot_AnimBP_C>();
	}
};

}

