#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "MediaUtils_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "CommonUI_structs.hpp"
#include "Party_structs.hpp"
#include "SocialUMG_structs.hpp"


namespace SDK::Params
{

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortQuestMapDetailsPanelBase.SetQuestToDisplay
// 0x0008 (0x0008 - 0x0000)
struct FortQuestMapDetailsPanelBase_SetQuestToDisplay final
{
public:
	class UFortQuestItemDefinition*               QuestDef;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTransformResultsList.ShowRecycleResults
// 0x0010 (0x0010 - 0x0000)
struct FortTransformResultsList_ShowRecycleResults final
{
public:
	TArray<class UFortItem*>                      SacrificeItems;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortChatWidget.SetControllerActionBrush
// 0x0088 (0x0088 - 0x0000)
struct FortChatWidget_SetControllerActionBrush final
{
public:
	struct FSlateBrush                            SlateBrush;                                        // 0x0000(0x0088)(Parm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.LTMWidgetBase.OnGamePhaseChanged
// 0x0001 (0x0001 - 0x0000)
struct LTMWidgetBase_OnGamePhaseChanged final
{
public:
	EAthenaGamePhase                              NewPhase;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.LTMWidgetBase.OnHandleSpectatingChanged
// 0x0008 (0x0008 - 0x0000)
struct LTMWidgetBase_OnHandleSpectatingChanged final
{
public:
	class AFortPlayerStateZone*                   SpectatingTarget;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.LTMWidgetBase.GetViewingTeam
// 0x0001 (0x0001 - 0x0000)
struct LTMWidgetBase_GetViewingTeam final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationData.GetIconBrush
// 0x0090 (0x0090 - 0x0000)
struct FortRewardNotificationData_GetIconBrush final
{
public:
	struct FSlateBrush                            IconBrush;                                         // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	EFortBrushSize                                BrushSize;                                         // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0089(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.AshtonWidgetBase.OnStoneChanged
// 0x0002 (0x0002 - 0x0000)
struct AshtonWidgetBase_OnStoneChanged final
{
public:
	EAshtonStoneType                              StoneType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAshtonStoneStateType                         StoneState;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AshtonWidgetBase.OnVillainRespawnCountChanged
// 0x0008 (0x0008 - 0x0000)
struct AshtonWidgetBase_OnVillainRespawnCountChanged final
{
public:
	int32                                         NumRespawnsLeft;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RespawnPercentLeft;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AshtonWidgetBase.UpdateAllUI
// 0x0001 (0x0001 - 0x0000)
struct AshtonWidgetBase_UpdateAllUI final
{
public:
	bool                                          bFirstUpdate;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.DisplaySurveys
// 0x0018 (0x0018 - 0x0000)
struct AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_DisplaySurveys final
{
public:
	class UFortPlayerSurveyDispatcher*            Dispatcher_0;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SurveyCount;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* ReturnValue;                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.HandleAllSurveysFinished
// 0x0008 (0x0008 - 0x0000)
struct AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys_HandleAllSurveysFinished final
{
public:
	class UObject*                                Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.AddCollectionBookData
// 0x0068 (0x0068 - 0x0000)
struct FortRewardNotificationWidget_AddCollectionBookData final
{
public:
	struct FFortCollectionBookRewards             CollectionBookRewards;                             // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.AddEpicQuestData
// 0x0008 (0x0008 - 0x0000)
struct FortRewardNotificationWidget_AddEpicQuestData final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.AddExpeditionData
// 0x0008 (0x0008 - 0x0000)
struct FortRewardNotificationWidget_AddExpeditionData final
{
public:
	class UFortExpeditionItem*                    ExpeditionItem;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.AddItemCacheRewardData
// 0x0008 (0x0008 - 0x0000)
struct FortRewardNotificationWidget_AddItemCacheRewardData final
{
public:
	class UFortItem*                              ItemCache;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.AddQuestData
// 0x0008 (0x0008 - 0x0000)
struct FortRewardNotificationWidget_AddQuestData final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.InspectItem
// 0x0010 (0x0010 - 0x0000)
struct FortRewardNotificationWidget_InspectItem final
{
public:
	class UFortItem*                              ItemToInspect;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         QuantityOverride;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortRewardNotificationWidget.IsPrimaryActionEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortRewardNotificationWidget_IsPrimaryActionEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.IsPrimaryActionHidden
// 0x0001 (0x0001 - 0x0000)
struct FortRewardNotificationWidget_IsPrimaryActionHidden final
{
public:
	bool                                          bHidden;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.OnPrimaryActionTextChanged
// 0x0018 (0x0018 - 0x0000)
struct FortRewardNotificationWidget_OnPrimaryActionTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.SetPrimaryActionEnabled
// 0x0001 (0x0001 - 0x0000)
struct FortRewardNotificationWidget_SetPrimaryActionEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortRewardNotificationWidget.SetPrimaryActionText
// 0x0018 (0x0018 - 0x0000)
struct FortRewardNotificationWidget_SetPrimaryActionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccoladesWidget.OnXPEvent
// 0x0024 (0x0024 - 0x0000)
struct AthenaAccoladesWidget_OnXPEvent final
{
public:
	struct FXPEventEntry                          XPEvent;                                           // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccoladesWidget.OpenWidget
// 0x0048 (0x0048 - 0x0000)
struct AthenaAccoladesWidget_OpenWidget final
{
public:
	struct FXPDisplayData                         XPEventDisplayData;                                // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetTooltipAttributes
// 0x0018 (0x0018 - 0x0000)
struct FortTooltipUIContext_GetTooltipAttributes final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayAttribute>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTooltipUIContext.HasTooltipStats
// 0x0010 (0x0010 - 0x0000)
struct FortTooltipUIContext_HasTooltipStats final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetCombinedDescription
// 0x0030 (0x0030 - 0x0000)
struct FortTooltipUIContext_GetCombinedDescription final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortTooltipContext*              TooltipContext;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OutDescription;                                    // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bSummaryDescription;                               // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetComparisonStats
// 0x0030 (0x0030 - 0x0000)
struct FortTooltipUIContext_GetComparisonStats final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          ComparisonObject;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortTooltipContext*              TooltipContext;                                    // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSummaryTooltip;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFortDisplayAttribute>          ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTooltipUIContext.GetDescription
// 0x0028 (0x0028 - 0x0000)
struct FortTooltipUIContext_GetDescription final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortTooltipContext*              TooltipContext;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           OutDescription;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bSummaryDescription;                               // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetDisplayNameAndMultiBrushForTag
// 0x0358 (0x0358 - 0x0000)
struct FortTooltipUIContext_GetDisplayNameAndMultiBrushForTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OutDisplayName;                                    // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FFortMultiSizeBrush                    OutBrush;                                          // 0x0020(0x0330)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0350(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetTooltipLoadingWrapper
// 0x0018 (0x0018 - 0x0000)
struct FortTooltipUIContext_GetTooltipLoadingWrapper final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSummaryDescription;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortTooltipLoadingWrapper*             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTooltipUIContext.GetTooltipStat
// 0x0090 (0x0090 - 0x0000)
struct FortTooltipUIContext_GetTooltipStat final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                    TooltipContext;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Token;                                             // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortDisplayAttribute                  OutDisplayAttribute;                               // 0x0018(0x0070)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          bUseSummaryTooltip;                                // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0089(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetTooltipStats
// 0x0028 (0x0028 - 0x0000)
struct FortTooltipUIContext_GetTooltipStats final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UFortTooltipContext*              TooltipContext;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSummaryStats;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFortDisplayAttribute>          ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTooltipUIContext.GetUIDataForTag
// 0x0378 (0x0378 - 0x0000)
struct FortTooltipUIContext_GetUIDataForTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFortTagUIData                         OutData;                                           // 0x0008(0x0368)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0370(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortTooltipUIContext.GetUpgradeStats
// 0x0028 (0x0028 - 0x0000)
struct FortTooltipUIContext_GetUpgradeStats final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortTooltipContext*                    TooltipContext;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSummaryTooltip;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFortDisplayAttribute>          ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortCollectionBookRewardCardWidget.SetRewards
// 0x0030 (0x0030 - 0x0000)
struct FortCollectionBookRewardCardWidget_SetRewards final
{
public:
	struct FFortRewardInfo                        Rewards;                                           // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortCollectionBookRewardCardWidget.HasRewards
// 0x0001 (0x0001 - 0x0000)
struct FortCollectionBookRewardCardWidget_HasRewards final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetBattleBookPurchaseLimit final
{
public:
	int32                                         MaxNumLevelsPossibleToPurchase;                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonDefinition
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonDefinition final
{
public:
	class UAthenaSeasonItemDefinition*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
// 0x000C (0x000C - 0x0000)
struct AthenaAccountContext_SimulateBattleBookPurchase final
{
public:
	int32                                         NumLevelsToPurchase;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverLimit;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumber
// 0x0004 (0x0004 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonNumberAsText
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonNumberAsText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.IsAtMaxBattlePassTier
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_IsAtMaxBattlePassTier final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAccountContext.ShouldReplaceBattleStarsWithAlternateReward
// 0x0001 (0x0001 - 0x0000)
struct AthenaAccountContext_ShouldReplaceBattleStarsWithAlternateReward final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerController
// 0x0008 (0x0008 - 0x0000)
struct AthenaAIKillsBase_SetKillsSourcePlayerController final
{
public:
	class AFortPlayerControllerAthena*            InPlayerController;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAIKillsBase.SetKillsSourcePlayerState
// 0x0008 (0x0008 - 0x0000)
struct AthenaAIKillsBase_SetKillsSourcePlayerState final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSettingsListEntryBase.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct FortSettingsListEntryBase_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTeamMemberEntryBase.BP_OnTeamMemberEstablished
// 0x0001 (0x0001 - 0x0000)
struct FortTeamMemberEntryBase_BP_OnTeamMemberEstablished final
{
public:
	bool                                          bHasValidMember;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTeamMemberEntryBase.OnMemberGameReadinessChanged
// 0x0001 (0x0001 - 0x0000)
struct FortTeamMemberEntryBase_OnMemberGameReadinessChanged final
{
public:
	EGameReadiness                                ReadyStatus;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTeamMemberEntryBase.OnMemberIsInFrontendChanged
// 0x0001 (0x0001 - 0x0000)
struct FortTeamMemberEntryBase_OnMemberIsInFrontendChanged final
{
public:
	bool                                          bIsInFrontend;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTeamMemberEntryBase.GetCurrentMemberGameReadiness
// 0x0001 (0x0001 - 0x0000)
struct FortTeamMemberEntryBase_GetCurrentMemberGameReadiness final
{
public:
	EGameReadiness                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTeamMemberEntryBase.IsCurrentMemberInFrontend
// 0x0001 (0x0001 - 0x0000)
struct FortTeamMemberEntryBase_IsCurrentMemberInFrontend final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortTeamMemberEntryBase.IsCurrentMemberLocal
// 0x0001 (0x0001 - 0x0000)
struct FortTeamMemberEntryBase_IsCurrentMemberLocal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortCampaignTeamMemberEntry.OnTeamMemberConnectionStateChanged
// 0x0001 (0x0001 - 0x0000)
struct FortCampaignTeamMemberEntry_OnTeamMemberConnectionStateChanged final
{
public:
	EFortMemberConnectionState                    NewConnectionState;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortCampaignTeamMemberEntry.HasTeamMembers
// 0x0001 (0x0001 - 0x0000)
struct FortCampaignTeamMemberEntry_HasTeamMembers final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortCampaignTeamMemberDailyBonusXpBoost.GetCurrentBoostAmount
// 0x0004 (0x0004 - 0x0000)
struct FortCampaignTeamMemberDailyBonusXpBoost_GetCurrentBoostAmount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAwardAlertBase.OnAwardGranted
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_OnAwardGranted final
{
public:
	class UFortAwardItemDefinition*               AwardDefinition;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaAwardAlertBase.SetDataSource
// 0x0008 (0x0008 - 0x0000)
struct AthenaAwardAlertBase_SetDataSource final
{
public:
	class UAthenaPlayerViewModel*                 PlayerViewModel;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaBattleMapClickHandler.HandleToggledBattleMapLive
// 0x0008 (0x0008 - 0x0000)
struct AthenaBattleMapClickHandler_HandleToggledBattleMapLive final
{
public:
	class ABattleMapPawnLive*                     BattleMapPawn;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortSettingDetailView.GatherDetailExtensions
// 0x0018 (0x0018 - 0x0000)
struct FortSettingDetailView_GatherDetailExtensions final
{
public:
	class UFortSetting*                           InSetting;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortCollectionBookOverviewWidget.HandlePagesChanged
// 0x0008 (0x0008 - 0x0000)
struct FortCollectionBookOverviewWidget_HandlePagesChanged final
{
public:
	class UFortCollectionBookManager*             CBManager;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.AttemptOpenPackByIndex
// 0x0004 (0x0004 - 0x0000)
struct FortStoreContext_AttemptOpenPackByIndex final
{
public:
	int32                                         CardPackIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardAddedToSummaryComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardAddedToSummaryComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardBackRevealComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardBackRevealComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardEntryComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardEntryComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardExitComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardExitComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardFlipComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardFlipComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardFrontRevealComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardFrontRevealComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardPackDestroyComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardPackDestroyComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.CardPackOpeningComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_CardPackOpeningComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ChoiceResultComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ChoiceResultComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.EnterCardPackStore
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_EnterCardPackStore final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.EnterCurrencyStore
// 0x0018 (0x0018 - 0x0000)
struct FortStoreContext_EnterCurrencyStore final
{
public:
	class FString                                 AttemptedPurchaseCardPackId;                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.ErrorOccurred
// 0x0018 (0x0018 - 0x0000)
struct FortStoreContext_ErrorOccurred final
{
public:
	class FString                                 ErrorAnalytics;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.ExitCardPackStore
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ExitCardPackStore final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ExitCurrencyStore
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ExitCurrencyStore final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ExitSummary
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ExitSummary final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ExitWebPayment
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ExitWebPayment final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetAccountItems
// 0x0020 (0x0020 - 0x0000)
struct FortStoreContext_GetAccountItems final
{
public:
	TArray<class UFortAccountItemDefinition*>     AccountItemDefinitions;                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UFortAccountItem*>               AccountItems;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetRarityColor
// 0x0014 (0x0014 - 0x0000)
struct FortStoreContext_GetRarityColor final
{
public:
	EFortRarity                                   Rarity;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLinearColor                           ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetTimeUntilDailyLimitReset
// 0x0008 (0x0008 - 0x0000)
struct FortStoreContext_GetTimeUntilDailyLimitReset final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetTimeUntilMarketplaceRefresh
// 0x0008 (0x0008 - 0x0000)
struct FortStoreContext_GetTimeUntilMarketplaceRefresh final
{
public:
	struct FTimespan                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.MakeChoice
// 0x0008 (0x0008 - 0x0000)
struct FortStoreContext_MakeChoice final
{
public:
	int32                                         ChoiceIdx;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.MakePurchase
// 0x0088 (0x0088 - 0x0000)
struct FortStoreContext_MakePurchase final
{
public:
	struct FCardPackOffer                         Offer;                                             // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UFortCardPackItemDefinition*            CardPackDefinition;                                // 0x0078(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Quantity;                                          // 0x0080(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECardPackPurchaseError                        ReturnValue;                                       // 0x0084(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.OpenWebPayment
// 0x0018 (0x0018 - 0x0000)
struct FortStoreContext_OpenWebPayment final
{
public:
	class FString                                 AttemptedMTXOfferId;                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.PurchaseOpeningComplete
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_PurchaseOpeningComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ShouldShowNewMtxStoreUi
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ShouldShowNewMtxStoreUi final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.StoreHasStarsForSale
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_StoreHasStarsForSale final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.FireInteractionAnalyticsEvent
// 0x0020 (0x0020 - 0x0000)
struct FortStoreContext_FireInteractionAnalyticsEvent final
{
public:
	class FString                                 Interaction;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Details;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetCard
// 0x0028 (0x0028 - 0x0000)
struct FortStoreContext_GetCard final
{
public:
	int32                                         CardIdx;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FCard                                  ResultOut;                                         // 0x0008(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.GetChoiceCards
// 0x0018 (0x0018 - 0x0000)
struct FortStoreContext_GetChoiceCards final
{
public:
	int32                                         CardIdx;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FCard>                          ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetNumUnopenedCardPacksRemaining
// 0x0010 (0x0010 - 0x0000)
struct FortStoreContext_GetNumUnopenedCardPacksRemaining final
{
public:
	const class UFortCardPackItemDefinition*      PackType;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCountChoicePacks;                                 // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetOwnedItemCount
// 0x0010 (0x0010 - 0x0000)
struct FortStoreContext_GetOwnedItemCount final
{
public:
	const class UFortItemDefinition*              ItemDefinition;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.FortStoreContext.GetPreviousState
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_GetPreviousState final
{
public:
	EFortStoreState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.GetStoreState
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_GetStoreState final
{
public:
	EFortStoreState                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.IsOpeningDirectPack
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_IsOpeningDirectPack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.IsOpeningOnePack
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_IsOpeningOnePack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.IsWaitingForMcp
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_IsWaitingForMcp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ShouldShowNewVBuckCoinAssetsJuly2019
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ShouldShowNewVBuckCoinAssetsJuly2019 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.FortStoreContext.ShouldShowNewVBuckColorsJuly2019
// 0x0001 (0x0001 - 0x0000)
struct FortStoreContext_ShouldShowNewVBuckColorsJuly2019 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleCameraTypeChanged
// 0x0010 (0x0010 - 0x0000)
struct AthenaBattleMapNodeTooltip_HandleCameraTypeChanged final
{
public:
	class AFortPlayerControllerSpectating*        SpectatorPC;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpectatorCameraType                          NewCameraType;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleHoveredNode
// 0x0010 (0x0010 - 0x0000)
struct AthenaBattleMapNodeTooltip_HandleHoveredNode final
{
public:
	const class ABattleMapNode*                   Node;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBattleMapHoveredReason                       Reason;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function FortniteUI.AthenaBattleMapNodeTooltip.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaBattleMapNodeTooltip_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

