#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Athena_TNT_WithTrajectory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Athena_Grenade_WithTrajectory_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_TNT_WithTrajectory.GA_Athena_TNT_WithTrajectory_C
// 0x0040 (0x0CD8 - 0x0C98)
class UGA_Athena_TNT_WithTrajectory_C final : public UGA_Athena_Grenade_WithTrajectory_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_TNT_WithTrajectory_C;     // 0x0C98(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         FuseDuration;                                      // 0x0CA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA4[0x4];                                      // 0x0CA4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           CookHandle;                                        // 0x0CA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Fuse_Sound;                                        // 0x0CB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ExplosionCameraShake;                              // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    Projectile;                                        // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FusePitchHandle;                                   // 0x0CC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         GrenadeSpeedFumble;                                // 0x0CD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinFuseTime;                                       // 0x0CD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_TNT_WithTrajectory(int32 EntryPoint);
	void InitTrajectoryVariables();
	void K2_ActivateAbility();
	void AthenaProjectileSpawned(class AFortProjectileBase* ProjectileReference_0);
	void OnDamagedFatal(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Spawn_Server_Projectile_Involuntary(const struct FVector& Location, const struct FRotator& Direction, bool bAllowSpawnWhenDead, bool bAllowSpawnWhenDBNO);
	void OnPlayerStartDBNO();
	void K2_OnEndAbility(bool bWasCancelled);
	void InvoluntaryThrow();
	void Created_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Touched_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Bounced_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Stopped_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Exploded_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void Destroyed_9AAF71F0497FA46B4152D699BE4F7F03(const struct FProjectileEventData& ProjectileData);
	void CurveRowLookup();

	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_TNT_WithTrajectory_C">();
	}
	static class UGA_Athena_TNT_WithTrajectory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_TNT_WithTrajectory_C>();
	}
};

}

