#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Ranged_GenericProjectileImpact_HookGun

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_Ranged_GenericDamage_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Ranged_GenericProjectileImpact_HookGun.GA_Ranged_GenericProjectileImpact_HookGun_C
// 0x0048 (0x09F0 - 0x09A8)
class UGA_Ranged_GenericProjectileImpact_HookGun_C final : public UGA_Ranged_GenericDamage_C
{
public:
	struct FGameplayTagContainer                  ChangeEquipmentTag;                                // 0x09A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           RopeActiveTag;                                     // 0x09C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x09D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ObjStat;                                           // 0x09E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void K2_OnEndAbility(bool bWasCancelled);
	void Overflow(class UFortWorldItem* Item_Dropped);
	void K2_CommitExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ranged_GenericProjectileImpact_HookGun_C">();
	}
	static class UGA_Ranged_GenericProjectileImpact_HookGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ranged_GenericProjectileImpact_HookGun_C>();
	}
};

}

