#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GameSettingsDetailView

#include "Basic.hpp"


namespace SDK::Params
{

// Function GameSettingsDetailView.GameSettingsDetailView_C.GatherDetailExtensions
// 0x0058 (0x0058 - 0x0000)
struct GameSettingsDetailView_C_GatherDetailExtensions final
{
public:
	class UFortSetting*                           InSetting;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftClassPtr<class UClass>>           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, UObjectWrapper)
	TArray<TSoftClassPtr<class UClass>>           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortSettingControllerInput*            K2Node_DynamicCast_AsFort_Setting_Controller_Input; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortSettingValueDiscrete*              K2Node_DynamicCast_AsFort_Setting_Value_Discrete;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<TSoftClassPtr<class UClass>>           K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
};

}

