#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HalfShieldPotion_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HalfShieldPotion_Prop_AnimBP.HalfShieldPotion_Prop_AnimBP_C
// 0x0100 (0x0368 - 0x0268)
class UHalfShieldPotion_Prop_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D18361C34D981BDD1A63009152AAF787; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4E170F124EACAF56EFA1518CC3C8608F; // 0x02A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1388951E4BA0BDBA8187FB9DC79ADE82; // 0x02F0(0x0078)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_HalfShieldPotion_Prop_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HalfShieldPotion_Prop_AnimBP_C">();
	}
	static class UHalfShieldPotion_Prop_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHalfShieldPotion_Prop_AnimBP_C>();
	}
};

}

