#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: KairosSceneCapture

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "KairosSceneCapture_structs.hpp"


namespace SDK
{

// Class KairosSceneCapture.KairosCaptureStatics
// 0x0000 (0x0028 - 0x0028)
class UKairosCaptureStatics final : public UBlueprintFunctionLibrary
{
public:
	static class AKairosSceneManagerActor* GetSceneManager(const class UObject* WorldContextObject);
	static void ToggleAutoRotate(bool bIsAutoRotateAllowed);

	void PauseOrResumeSnippet(const struct FKairosSnippetParams& Params_0, const struct FWebJSResponse& Response);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosCaptureStatics">();
	}
	static class UKairosCaptureStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKairosCaptureStatics>();
	}
};

// Class KairosSceneCapture.KairosConfig
// 0x0140 (0x0170 - 0x0030)
class UKairosConfig final : public UDataAsset
{
public:
	float                                         DefaultHeroScale;                                  // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ARSpawnStartingScale;                              // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AKairosHeroBase>            AvatarCaptureBlueprint;                            // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AFortPlayerPawnAthena>      DefaultKairosPawn;                                 // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARSessionConfig*                       FaceARConfig;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  ARMap;                                             // 0x0050(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                  CaptureMap;                                        // 0x0078(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           KairosMenuIdle_Male;                               // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           KairosMenuIdle_Female;                             // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             AvatarRenderCameraLocation_CloseUp;                // 0x00B0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             AvatarRenderCameraLocation_Bust;                   // 0x00E0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             AvatarRenderCameraLocation_Torso;                  // 0x0110(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             AvatarRenderCameraLocation_FullBody;               // 0x0140(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosConfig">();
	}
	static class UKairosConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKairosConfig>();
	}
};

// Class KairosSceneCapture.KairosGameModeBase
// 0x0008 (0x02C0 - 0x02B8)
class AKairosGameModeBase final : public AGameModeBase
{
public:
	class UKairosConfig*                          DefaultConfig;                                     // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UKairosConfig* GetDefaultConfig();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosGameModeBase">();
	}
	static class AKairosGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosGameModeBase>();
	}
};

// Class KairosSceneCapture.KairosHeroBase
// 0x0030 (0x0248 - 0x0218)
class AKairosHeroBase final : public AActor
{
public:
	class FString                                 PlayerID;                                          // 0x0218(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBeingCaptured;                                  // 0x0228(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosHeroAnimationState                     CurrentAnimationState;                             // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EKairosHeroSkeletonType                       SkeletonType;                                      // 0x0239(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class AFortPlayerPawn*                        CapturePawn;                                       // 0x0240(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool BeginCapture(const struct FKairosAnimationFramingInfo& FramingInfo, const struct FKairosCaptureParams& CaptureParams);
	bool EndCapture();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosHeroBase">();
	}
	static class AKairosHeroBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosHeroBase>();
	}
};

// Class KairosSceneCapture.KairosPawn
// 0x0000 (0x0278 - 0x0278)
class AKairosPawn final : public APawn
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosPawn">();
	}
	static class AKairosPawn* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosPawn>();
	}
};

// Class KairosSceneCapture.KairosPlayerController
// 0x0000 (0x0568 - 0x0568)
class AKairosPlayerController final : public APlayerController
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosPlayerController">();
	}
	static class AKairosPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosPlayerController>();
	}
};

// Class KairosSceneCapture.KairosSceneManagerActor
// 0x0188 (0x03A0 - 0x0218)
class AKairosSceneManagerActor final : public AActor
{
public:
	TMap<class FString, struct FKairosAvatarDisplayInfo> DisplayAvatars;                             // 0x0218(0x0050)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             SpawnedPawnHeadCaptureTransform;                   // 0x0270(0x0030)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class UAudioComponent*                        SnippetAudioComponent;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            ActiveGroupWidget;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSnippetPaused;                                  // 0x02B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x1F];                                     // 0x02B1(0x001F)(Fixing Size After Last Property [ Dumper-8 ])
	struct FKairosSceneInfo                       ActiveSceneInfo;                                   // 0x02D0(0x0020)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0xB0];                                     // 0x02F0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BeginEmotePlaybackForPlayer(const class FString& PlayerID, const class FString& EmoteID);
	const struct FKairosSceneInfo GetSceneInfo();
	void LoadWorldARMode();
	void OLD_OnSceneSetupComplete(const struct FKairosSceneInfo& CompleteSceneInfoCopy);
	void PauseOrResumeSnippet(const class FString& PlayerID, bool bShouldPase);
	void StopAR();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KairosSceneManagerActor">();
	}
	static class AKairosSceneManagerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKairosSceneManagerActor>();
	}
};

}

