#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Mech_Veh_ControRig_Parts

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass Mech_Veh_ControRig_Parts.Mech_Veh_ControRig_Parts_C
// 0x0F28 (0x11A0 - 0x0278)
class UMech_Veh_ControRig_Parts_C final : public UControlRig
{
public:
	struct FRigUnit_BeginExecution                BeginExecution_0;                                  // 0x0278(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FRigUnit_AimBone                       AimBone_0;                                         // 0x02C0(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Paw_Calf_L;                                        // 0x03C0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_0;                                 // 0x04B0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_0;                         // 0x0520(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                       AimBone_1;                                         // 0x0590(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_1;                         // 0x0690(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Paw_Thigh_L;                                       // 0x0700(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_1;                                 // 0x07F0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                       AimBone_2;                                         // 0x0860(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_AimBone                       AimBone_3;                                         // 0x0960(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Clav_L;                                            // 0x0A60(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_2;                         // 0x0B50(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_2;                                 // 0x0BC0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_5;                         // 0x0C30(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Upperarm_L;                                        // 0x0CA0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_4;                                 // 0x0D90(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Clav_R;                                            // 0x0E00(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_8;                         // 0x0EF0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_6;                                 // 0x0F60(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetInitialBoneTransform       GetInitialBoneTransform_9;                         // 0x0FD0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_Control                       Upperarm_R;                                        // 0x1040(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_7;                                 // 0x1130(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mech_Veh_ControRig_Parts_C">();
	}
	static class UMech_Veh_ControRig_Parts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMech_Veh_ControRig_Parts_C>();
	}
};

}

