#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Pickaxe_Rhino_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pickaxe_Rhino_AnimBlueprint.Pickaxe_Rhino_AnimBlueprint_C
// 0x0658 (0x08C0 - 0x0268)
class UPickaxe_Rhino_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_B338F36F4A96F29AF29546A430EEB6D1; // 0x0278(0x0030)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_0A688F724C4804496F7057B1DA3573EF; // 0x02A8(0x0070)()
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_69841E3A45072CCDC404A5BB8795C346; // 0x0320(0x0560)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28CBDE064A82CB1CEAD5B4963C22704A; // 0x0880(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_62E8F4EB43FE70F8EDDEF08EAD87625B; // 0x08A0(0x0020)()

public:
	void ExecuteUbergraph_Pickaxe_Rhino_AnimBlueprint(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pickaxe_Rhino_AnimBlueprint_C">();
	}
	static class UPickaxe_Rhino_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxe_Rhino_AnimBlueprint_C>();
	}
};

}

