#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Pistol_Revolver_SideAction_AnimBP1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pistol_Revolver_SideAction_AnimBP1.Pistol_Revolver_SideAction_AnimBP1_C
// 0x07D8 (0x0A40 - 0x0268)
class UPistol_Revolver_SideAction_AnimBP1_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_CDDFF76A4896153EE4A1F89D027B3A81; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ECC95F6741DA3B90EFE754B4020E142F; // 0x02A8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5F067A87494E3F5CA0FD35BE6D823899; // 0x02F0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22B493C84E2826898F39A3BE2BDE4592; // 0x03B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8461A45D4BD1364A51FED481EA992512; // 0x03E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A9383C4B4E08EA21D593A7813CB73765; // 0x0408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6589BAFF47EDBA94394D7384A7337675; // 0x0430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93A44DE846435EB02304578E39F0170D; // 0x0458(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1EB88F604BDE635D97A524BB426B0089; // 0x0480(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1EF390EA4EC30B00D12AF681BE6E7978; // 0x04A8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E1DC4C1A42B317E86DF3008DC446867D; // 0x04D0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B8EFB3CE4C88361F9F266AACDC047A46; // 0x0548(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_484F09224D8B8EC86E728786A4071496; // 0x0578(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2A5822084DDC6C7C00AD8691B1DB431E; // 0x05F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0D4DD44F4BC8A40EAA3F6BAD22959723; // 0x0620(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78BAC54C45BE971048FD22B904773E31; // 0x0698(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A98EA20C4932D0827D500792CE250873; // 0x06C8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2B44584E4EC6E751153196B0C357029D; // 0x0740(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0C4CC7E341EF2EE86A85FB9B477CB100; // 0x0770(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A4D028704BACF073C64E4FA45D681FC2; // 0x07E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4E6337AA41097662F07206B98054C2A6; // 0x0818(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11E879B84C7A29FCE58E41A584217F19; // 0x0890(0x0030)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_6DF28DCC49C4DF9C2E8EEBA32AD620AA; // 0x08C0(0x0018)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DD2F6765469B797183B0629B47EA0E8A; // 0x08D8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_840FFAE24DD44FA1297C869A7DE741E9; // 0x0908(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3381CE494ED9270A1F73BD9D0613021B; // 0x09B8(0x0078)()
	int32                                         DrumPositionCount;                                 // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldRotateToPos1;                                // 0x0A34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos2;                                // 0x0A35(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos3;                                // 0x0A36(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos4;                                // 0x0A37(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos5;                                // 0x0A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldRotateToPos6;                                // 0x0A39(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Pistol_Revolver_SideAction_AnimBP1(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_Revolver_RotChamber();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pistol_Revolver_SideAction_AnimBP1_C">();
	}
	static class UPistol_Revolver_SideAction_AnimBP1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPistol_Revolver_SideAction_AnimBP1_C>();
	}
};

}

