#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PlayerSurveyPanelAnswerSelectorWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerSurveyPanelAnswerSelectorWidget.PlayerSurveyPanelAnswerSelectorWidget_C
// 0x0078 (0x02B0 - 0x0238)
class UPlayerSurveyPanelAnswerSelectorWidget_C final : public UFortPlayerSurveyQuestionDisplayWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                EmptyWidget;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class UClass*, class UFortPlayerSurveyAnswerWidgetBase*> SwitcherWidgets;                   // 0x0250(0x0050)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)
	class UFortPlayerSurveyAnswerWidgetBase*      CurrentChild;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerSurveyAnswerWidgetDataTable* AnswerWidgetTable;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PlayerSurveyPanelAnswerSelectorWidget(int32 EntryPoint);
	void HandleQuestionChanged();
	void OnInitialized();
	void Construct();
	void InitSwitcherChildrenLoop(EFortPlayerSurveyQuestionType QuestionType, EFortPlayerSurveyQuestionPresentationStyle PresentationStyle, class UClass* WidgetClass);
	void InitSwitcherChildren();
	void UpdateCurrentChild(bool ForcePropagateQuestion);
	void SetCurrentChild(class UFortPlayerSurveyAnswerWidgetBase* Widget, bool ForcePropagateQuestion);
	void CommitCurrentAnswer();
	void PropagateCurrentQuestion();

	void GetDefaultFocusedWidget(class UWidget** Result) const;
	void GetSubtitleText(class FText* Text) const;
	void GetCurrentQuestion(class UFortPlayerSurveyQuestion** Question) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerSurveyPanelAnswerSelectorWidget_C">();
	}
	static class UPlayerSurveyPanelAnswerSelectorWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerSurveyPanelAnswerSelectorWidget_C>();
	}
};

}

