#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Prop_QuestInteractable_HiddenStar_Parent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Prop_QuestInteractable_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prop_QuestInteractable_HiddenStar_Parent.Prop_QuestInteractable_HiddenStar_Parent_C
// 0x0098 (0x0CA0 - 0x0C08)
class AProp_QuestInteractable_HiddenStar_Parent_C final : public AProp_QuestInteractable_Parent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prop_QuestInteractable_HiddenStar_Parent_C; // 0x0C08(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       SphereOverlapHide;                                 // 0x0C10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SphereOverlapReveal;                               // 0x0C18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_BattlePassStar;                                 // 0x0C20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Fade_Out_FadeTime_4C0B3DE24D5B36BDB4F6A2A5FEB21686; // 0x0C28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Fade_Out__Direction_4C0B3DE24D5B36BDB4F6A2A5FEB21686; // 0x0C2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2D[0x3];                                      // 0x0C2D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Fade_Out;                                          // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Reveal_RevealTime_46F97E4E4AD8933493192F964DF78BEB; // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Reveal__Direction_46F97E4E4AD8933493192F964DF78BEB; // 0x0C3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3D[0x3];                                      // 0x0C3D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Reveal;                                            // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Disappear_ScaleDownTime_CBCFE92949908DE5830C0DBA05879CDD; // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Disappear__Direction_CBCFE92949908DE5830C0DBA05879CDD; // 0x0C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4D[0x3];                                      // 0x0C4D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Disappear;                                         // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Bob_and_Spin_Spin_A0B6BD3646613635CD88BF81DE4EDDC5; // 0x0C58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Bob_and_Spin_Bob_A0B6BD3646613635CD88BF81DE4EDDC5; // 0x0C5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Bob_and_Spin__Direction_A0B6BD3646613635CD88BF81DE4EDDC5; // 0x0C60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C61[0x7];                                      // 0x0C61(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Bob_and_Spin;                                      // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Collectable;                                       // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C71[0x3];                                      // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FVector                                SMLocationInit;                                    // 0x0C74(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BattleStarMat;                                     // 0x0C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isBanner;                                          // 0x0C88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C89[0x7];                                      // 0x0C89(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture*                               BannerTexture;                                     // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseTranslucentStar;                               // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void ThisQuestObjectiveComplete(class AFortPawn* IneractingPawn);
	void QuestInitializedAndValid();
	void ReceiveBeginPlay();
	void Bob_and_Spin__FinishedFunc();
	void Bob_and_Spin__UpdateFunc();
	void Reveal__FinishedFunc();
	void Reveal__UpdateFunc();
	void Disappear__FinishedFunc();
	void Disappear__UpdateFunc();
	void Fade_Out__FinishedFunc();
	void Fade_Out__UpdateFunc();
	void Star_Reveal(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void DeactivateHiddenStar();
	void Star_Hide(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void ExecuteUbergraph_Prop_QuestInteractable_HiddenStar_Parent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_QuestInteractable_HiddenStar_Parent_C">();
	}
	static class AProp_QuestInteractable_HiddenStar_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProp_QuestInteractable_HiddenStar_Parent_C>();
	}
};

}

