#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SK_ChillBronco_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_ChillBronco_AnimBP.SK_ChillBronco_AnimBP_C
// 0x0BA8 (0x0E10 - 0x0268)
class USK_ChillBronco_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C4E7C10B4123546D5E4707ADA0584F21; // 0x0278(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_56961C9147FF433DCC0DF5B564D419BC; // 0x0298(0x0020)()
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5EBC59BD4088DABE5FBB73A504160CAB; // 0x02C0(0x0440)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_26B47E4B4E9A29D3656E56BDB7BEE893; // 0x0700(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29EF0641464C2ABACCC4E1868B9A2BE0; // 0x0770(0x0030)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_07B9D0C44196FD0A18AD70A0D38A8826; // 0x07A0(0x0560)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D0FBBBD1410F7C5A52B45EAB29BDA57E; // 0x0D00(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_SK_ChillBronco_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_ChillBronco_AnimBP_C">();
	}
	static class USK_ChillBronco_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_ChillBronco_AnimBP_C>();
	}
};

}

