#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialUMG

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "UMG_classes.hpp"
#include "Party_structs.hpp"
#include "Party_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SocialUMG_structs.hpp"


namespace SDK
{

// Class SocialUMG.SocialChatChannelTab
// 0x0010 (0x0B50 - 0x0B40)
class USocialChatChannelTab : public UCommonButton
{
public:
	class USocialChatChannel*                     ChatChannel;                                       // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       CommonText_ChannelName;                            // 0x0B48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatChannelTab">();
	}
	static class USocialChatChannelTab* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatChannelTab>();
	}
};

// Class SocialUMG.SocialChatContainer
// 0x0058 (0x0280 - 0x0228)
class USocialChatContainer : public UUserWidget
{
public:
	class USocialChatManager*                     ChatManager;                                       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class USocialChatChannel*>             JoinedChannels;                                    // 0x0230(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USocialChatChannel*                     ActiveChannel;                                     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonGroup*                     TabButtonGroup;                                    // 0x0248(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x8];                                      // 0x0250(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class USocialChatMessageList*                 ChatList_Messages;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialChatEditableText*                ChatEditableText_MessageEntry;                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_SendMessage;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicEntryBox*                       EntryBox_JoinedChannels;                           // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScrollBox*                             ScrollBox_Channels;                                // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DynamicHandleMessageTextCommitted(const class FText& MessageText, ETextCommit CommitMethod);
	void FocusEditableText();
	void HandleLeftTabPressed();
	void HandleRightTabPressed();
	void OnChatOpenChanged(bool bShouldBeOpen);
	void SendCurrentMessage();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatContainer">();
	}
	static class USocialChatContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatContainer>();
	}
};

// Class SocialUMG.SocialChatEditableText
// 0x04E0 (0x05E0 - 0x0100)
class USocialChatEditableText final : public UWidget
{
public:
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-8 ])
	struct FEditableTextStyle                     EditableTextStyle;                                 // 0x0120(0x0218)(Edit, NativeAccessSpecifierPrivate)
	struct FTextBlockStyle                        AutoCompleteStyle;                                 // 0x0338(0x0268)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5A0[0x40];                                     // 0x05A0(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatEditableText">();
	}
	static class USocialChatEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatEditableText>();
	}
};

// Class SocialUMG.SocialChatMessageEntry
// 0x0148 (0x0370 - 0x0228)
class USocialChatMessageEntry : public UUserWidget
{
public:
	uint8                                         Pad_228[0x18];                                     // 0x0228(0x0018)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSocialChatMessageEntryStyle           DefaultStyle;                                      // 0x0240(0x0120)(Edit, Protected, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   RichText_Message;                                  // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UButton*                                Button_MessageButton;                              // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnMessageSet();

	bool CanInteract() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageEntry">();
	}
	static class USocialChatMessageEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageEntry>();
	}
};

// Class SocialUMG.SocialChatMessageList
// 0x00F0 (0x0300 - 0x0210)
class USocialChatMessageList final : public UListViewBase
{
public:
	uint8                                         Pad_210[0xC0];                                     // 0x0210(0x00C0)(Fixing Size After Last Property [ Dumper-8 ])
	bool                                          bIsFocusable;                                      // 0x02D0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class USocialChatChannel*                     ActiveChannel;                                     // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x20];                                     // 0x02E0(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialChatMessageList">();
	}
	static class USocialChatMessageList* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialChatMessageList>();
	}
};

// Class SocialUMG.SocialGroupListEntry
// 0x0028 (0x0B68 - 0x0B40)
class USocialGroupListEntry final : public UCommonButton
{
public:
	uint8                                         Pad_B40[0x8];                                      // 0x0B40(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class USocialActionMenu>          ActionMenuClass;                                   // 0x0B48(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USocialGroupChannel*                    SocialGroup;                                       // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_GroupName;                                    // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0B60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialGroupListEntry">();
	}
	static class USocialGroupListEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupListEntry>();
	}
};

// Class SocialUMG.SocialGroupTreeView
// 0x0020 (0x03D8 - 0x03B8)
class USocialGroupTreeView final : public UTreeView
{
public:
	TSubclassOf<class USocialGroupListEntry>      GroupEntryWidgetClass;                             // 0x03B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialListEntry_SocialUser> UserEntryWidgetClass;                             // 0x03C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialInteractionMenu>     ActionMenuClass;                                   // 0x03C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USocialInteractionMenu*                 ActionMenu;                                        // 0x03D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialGroupTreeView">();
	}
	static class USocialGroupTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialGroupTreeView>();
	}
};

// Class SocialUMG.SocialInteractionButton
// 0x0060 (0x0BA0 - 0x0B40)
class USocialInteractionButton : public UCommonButton
{
public:
	struct FLinearColor                           DefaultIndicatorColor;                             // 0x0B40(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                           AlertingIndicatorColor;                            // 0x0B50(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B60[0x30];                                     // 0x0B60(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class UCommonTextBlock*                       Text_InteractionName;                              // 0x0B90(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBorder*                                Border_InteractionIndicator;                       // 0x0B98(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnInteractionSet();

	class FName GetInteractionName() const;
	bool IsPlatformOnlyFriend() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionButton">();
	}
	static class USocialInteractionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionButton>();
	}
};

// Class SocialUMG.SocialActionMenu
// 0x0020 (0x0248 - 0x0228)
class USocialActionMenu : public UUserWidget
{
public:
	uint8                                         Pad_228[0x20];                                     // 0x0228(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialActionMenu">();
	}
	static class USocialActionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialActionMenu>();
	}
};

// Class SocialUMG.SocialInteractionMenu
// 0x0068 (0x02B0 - 0x0248)
class USocialInteractionMenu : public USocialActionMenu
{
public:
	uint8                                         Pad_248[0x30];                                     // 0x0248(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	class UDynamicEntryBox*                       EntryBox_PositiveInteractions;                     // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicEntryBox*                       EntryBox_NegativeInteractions;                     // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpacer*                                Spacer_InteractionSeparator;                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonWidgetSwitcher*                  Switcher_Confirmation;                             // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             Text_ConfirmationLabel;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_Confirm;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          Button_Decline;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnToggleConfirmation(bool bIsVisible);

	class UWidget* GetFirstEntryToCenter() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialInteractionMenu">();
	}
	static class USocialInteractionMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialInteractionMenu>();
	}
};

// Class SocialUMG.SocialNameTextBlock
// 0x0080 (0x0718 - 0x0698)
class USocialNameTextBlock : public UCommonRichTextBlock
{
public:
	class USocialUser*                            SocialUser;                                        // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinDesiredSize;                                    // 0x06A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxDesiredSize;                                    // 0x06A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowNickName;                                     // 0x06A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPlatformIconDisplayRule                      PlatformIconDisplayRule;                           // 0x06A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNickNameInNextLine;                               // 0x06AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverwriteNickNameColorAndSize;                    // 0x06AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FColor                                 NickNameColor;                                     // 0x06AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NickNameFontSize;                                  // 0x06B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFlippingNickName;                                 // 0x06B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B5[0x3];                                      // 0x06B5(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         DisplayTime;                                       // 0x06B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         NickNameDisplayTime;                               // 0x06BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeInDuration;                                    // 0x06C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeOutDuration;                                   // 0x06C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C8[0x50];                                     // 0x06C8(0x0050)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetNickNameColor(const struct FColor& InColor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialNameTextBlock">();
	}
	static class USocialNameTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialNameTextBlock>();
	}
};

// Class SocialUMG.DesignerPreviewChatChannel
// 0x0068 (0x0150 - 0x00E8)
class UDesignerPreviewChatChannel final : public USocialChatChannel
{
public:
	uint8                                         Pad_E8[0x68];                                      // 0x00E8(0x0068)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DesignerPreviewChatChannel">();
	}
	static class UDesignerPreviewChatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDesignerPreviewChatChannel>();
	}
};

// Class SocialUMG.SocialListEntryBase
// 0x0018 (0x0B58 - 0x0B40)
class USocialListEntryBase : public UCommonButton
{
public:
	uint8                                         Pad_B40[0x18];                                     // 0x0B40(0x0018)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListEntryBase">();
	}
	static class USocialListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntryBase>();
	}
};

// Class SocialUMG.SocialListInteractableEntryBase
// 0x0010 (0x0B68 - 0x0B58)
class USocialListInteractableEntryBase : public USocialListEntryBase
{
public:
	TSubclassOf<class USocialActionMenu>          ActionMenuClass;                                   // 0x0B58(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMenuAnchor*                            MenuAnchor_Actions;                                // 0x0B60(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWidget* HandleGetMenuContent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListInteractableEntryBase">();
	}
	static class USocialListInteractableEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListInteractableEntryBase>();
	}
};

// Class SocialUMG.SocialListUserEntryBase
// 0x0020 (0x0B88 - 0x0B68)
class USocialListUserEntryBase : public USocialListInteractableEntryBase
{
public:
	uint8                                         Pad_B68[0x8];                                      // 0x0B68(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class USocialNameTextBlock*                   Text_SocialName;                                   // 0x0B70(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRichTextBlock*                   Text_RichPresence;                                 // 0x0B78(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 Image_EncourageEpicFriend;                         // 0x0B80(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListUserEntryBase">();
	}
	static class USocialListUserEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListUserEntryBase>();
	}
};

// Class SocialUMG.SocialListEntry_SocialUser
// 0x0000 (0x0B88 - 0x0B88)
class USocialListEntry_SocialUser : public USocialListUserEntryBase
{
public:
	void OnUserPresenceChanged(EOnlineStatus OnlineStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialListEntry_SocialUser">();
	}
	static class USocialListEntry_SocialUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialListEntry_SocialUser>();
	}
};

// Class SocialUMG.SocialUserListHeaderEntry
// 0x0010 (0x0B68 - 0x0B58)
class USocialUserListHeaderEntry : public USocialListEntryBase
{
public:
	class UTextBlock*                             Text_ListName;                                     // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextBlock*                             Text_NumEntries;                                   // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListHeaderEntry">();
	}
	static class USocialUserListHeaderEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListHeaderEntry>();
	}
};

// Class SocialUMG.SocialUserListView
// 0x00E8 (0x02F8 - 0x0210)
class USocialUserListView : public UListViewBase
{
public:
	uint8                                         Pad_210[0xE0];                                     // 0x0210(0x00E0)(Fixing Size After Last Property [ Dumper-8 ])
	float                                         EntrySpacing;                                      // 0x02F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserListView">();
	}
	static class USocialUserListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserListView>();
	}
};

// Class SocialUMG.SocialUserTreeView
// 0x0100 (0x03F8 - 0x02F8)
class USocialUserTreeView : public USocialUserListView
{
public:
	uint8                                         Pad_2F8[0x70];                                     // 0x02F8(0x0070)(Fixing Size After Last Property [ Dumper-8 ])
	TSubclassOf<class USocialListEntry_SocialUser> UserEntryWidgetClass;                             // 0x0368(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class USocialListEntry_SocialUser> InviteEntryWidgetClass;                           // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0x28];                                     // 0x0378(0x0028)(Fixing Size After Last Property [ Dumper-8 ])
	class USocialActionMenu*                      ActiveActionMenu;                                  // 0x03A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class USocialActionMenu>, class USocialActionMenu*> CachedActionMenuPool;       // 0x03A8(0x0050)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SocialUserTreeView">();
	}
	static class USocialUserTreeView* GetDefaultObj()
	{
		return GetDefaultObjImpl<USocialUserTreeView>();
	}
};

}

