#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AthenaReplayBrowserTab

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaReplayBrowserTab.AthenaReplayBrowserTab_C
// 0x0050 (0x0408 - 0x03B8)
class UAthenaReplayBrowserTab_C final : public UAthenaReplayBrowserScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULeaderboardThrobber_C*                 LoadingThrobber;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          LowerBarBorder;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      OpenReplayFolder;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReplayBrowserRenameDialog_C*     RenameDialog;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        ReplayListView;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaReplayBrowserRowProxyInstance*   SelectedRowProxy;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LoadingTimerHandle;                                // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ViewStreamingReplayRow;                            // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void OnViewStreamingReplay(bool* PassThrough);
	void OnBackActionExecuted(bool* bPassThrough);
	void OnRenameActionExecuted(bool* bPassThrough);
	void OnDeleteActionExecuted(bool* bPassThrough);
	void OnPlayActionExecuted(bool* bPassThrough);
	void StartAthenaLobbyMusic();
	void RefreshReplayFolderState();
	void DoesSupportReplayFolder(bool* IsSupported);
	void OnShowLoadingThrobber();
	void OnActionStateChanged(bool ActionInProgress);
	void SetupInputActionHandlers();
	void CloseRenameDialog();
	void OnConfirmRename(const class FText& NewName);
	void HideInputActions();
	void FocusList();
	void SelectReplay(class UObject* ReplayInfoObject);
	void DialogResult_12ECDF8D47346477E6D96B927F5223CE(EFortDialogResult Result, class FName ResultName);
	void DialogResult_580DD63848C06A1FCA8D9DABDAF6FF77(EFortDialogResult Result, class FName ResultName);
	void DialogResult_E89869AF460753E34CA097BC86722E95(EFortDialogResult Result, class FName ResultName);
	void DialogResult_00986FB1494FF7EA41F1769EAFB70E83(EFortDialogResult Result, class FName ResultName);
	void DialogResult_961693C14B8B2A8E26E2AFB69251D5F8(EFortDialogResult Result, class FName ResultName);
	void DialogResult_79A680104EAA90FF10D265808FD512BC(EFortDialogResult Result, class FName ResultName);
	void DialogResult_F681A46A43F230E95DCC3F994D03E83C(EFortDialogResult Result, class FName ResultName);
	void DialogResult_5C8831094A522B13254093A66254221F(EFortDialogResult Result, class FName ResultName);
	void OnRowsUpdated();
	void OnActivated();
	void DeleteReplay(const class UAthenaReplayBrowserRowProxyInstance* RowProxy);
	void BndEvt__CommonListView_0_K2Node_ComponentBoundEvent_2_OnListViewItemClicked__DelegateSignature(class UObject* Item);
	void Construct();
	void PlayReplay(const class UAthenaReplayBrowserRowProxyInstance* RowProxy);
	void OnInputModeChanged(bool bUsingGamepad);
	void BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemClicked__DelegateSignature(class UObject* Item);
	void OnDeleteFailed(const class FText& Reason);
	void OnRenameFailed(const class FText& Reason);
	void OnSaveFailed(const class FText& Reason);
	void BndEvt__ReplayListView_K2Node_ComponentBoundEvent_0_OnListViewItemSelected__DelegateSignature(class UObject* Item, bool bIsSelected);
	void OnPlayFailed(const class FText& Reason);
	void BndEvt__OpenReplayFolder_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActionStarted();
	void OnActionFinished();
	void ShowDeleteInvalidDialog(const class FText& Title, const class FText& Message);
	void ExecuteUbergraph_AthenaReplayBrowserTab(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaReplayBrowserTab_C">();
	}
	static class UAthenaReplayBrowserTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReplayBrowserTab_C>();
	}
};

}

