#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_CameraRainDrops_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CameraRainDrops_03.B_CameraRainDrops_03_C
// 0x0020 (0x02F0 - 0x02D0)
class AB_CameraRainDrops_03_C final : public AEmitterCameraLensEffectBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Alpha_Alpha_510BB77E4E686B10F0392B81CE9926AC;      // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Alpha__Direction_510BB77E4E686B10F0392B81CE9926AC; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     Alpha;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void Alpha__UpdateFunc();
	void Alpha__FinishedFunc();
	void ExecuteUbergraph_B_CameraRainDrops_03(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CameraRainDrops_03_C">();
	}
	static class AB_CameraRainDrops_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CameraRainDrops_03_C>();
	}
};

}

