#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Melee_Torch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Melee_Edged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Melee_Torch.B_Melee_Torch_C
// 0x0048 (0x0AD0 - 0x0A88)
class AB_Melee_Torch_C final : public AB_Melee_Edged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Melee_Torch_C;                    // 0x0A88(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Torch_Fire_Start_Cue;                              // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Torch_Fire_Loop_Cue;                               // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Handle_Torch_Loop_Audio;                           // 0x0AB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Velocity_Smoothed;                                 // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Vector_Y;                                  // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Vector_Z;                                  // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Vector_X;                                  // 0x0AC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation_Smoothed;                                 // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Melee_Torch(int32 EntryPoint);
	void OnWeaponVisibilityChanged(bool bVisible);
	void K2_OnUnEquip();
	void OnWeaponAttached();
	void Play_Torch_Audio_Loop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Melee_Torch_C">();
	}
	static class AB_Melee_Torch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Melee_Torch_C>();
	}
};

}

