#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: B_Ranged_Flashlight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Pistol_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_Flashlight.B_Ranged_Flashlight_C
// 0x0048 (0x0EF0 - 0x0EA8)
class AB_Ranged_Flashlight_C final : public AB_Pistol_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Ranged_Flashlight_C;              // 0x0EA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Flashlight_Audio_Loop;                             // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Switch_Audio;                                      // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightbeamCollision;                                // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_CreativeMoveTool_Lightbeam;                     // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0ED0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Equip_Sound;                                       // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LightFunctionMaterial;                             // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpotlightBaseIntensity;                            // 0x0EE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpotlightLowQualityIntensityScale;                 // 0x0EEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Ranged_Flashlight(int32 EntryPoint);
	void OnWeaponAttached();
	void UserConstructionScript();
	void InitLightShadowQuality();
	void InitComponents();
	void SetMobileShadowsOff();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_Flashlight_C">();
	}
	static class AB_Ranged_Flashlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_Flashlight_C>();
	}
};

}

