#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SlurpJuice_Prop_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SlurpJuice_Prop_AnimBP.SlurpJuice_Prop_AnimBP_C
// 0x0100 (0x0368 - 0x0268)
class USlurpJuice_Prop_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_88BDDE744224870E2C760EAC7460A594; // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9884AB784F0D78B1AB55BD9ABAE04FAF; // 0x02A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_88BBE8574985A3AD7C7D4FB01D09E1CF; // 0x02F0(0x0078)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_SlurpJuice_Prop_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SlurpJuice_Prop_AnimBP_C">();
	}
	static class USlurpJuice_Prop_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USlurpJuice_Prop_AnimBP_C>();
	}
};

}

