#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: TabNewControllerNewSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function TabNewControllerNewSettings.TabNewControllerNewSettings_C.SettingValueChanged
// 0x0004 (0x0004 - 0x0000)
struct TabNewControllerNewSettings_C_SettingValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function TabNewControllerNewSettings.TabNewControllerNewSettings_C.ExecuteUbergraph_TabNewControllerNewSettings
// 0x0018 (0x0018 - 0x0000)
struct TabNewControllerNewSettings_C_ExecuteUbergraph_TabNewControllerNewSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

