#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ControlRig

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ControlRig.ControlRig.GetDeltaTime
// 0x0004 (0x0004 - 0x0000)
struct ControlRig_GetDeltaTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ControlRig.ControlRigControl.OnEnabledChanged
// 0x0001 (0x0001 - 0x0000)
struct ControlRigControl_OnEnabledChanged final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ControlRig.ControlRigControl.OnHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct ControlRigControl_OnHoveredChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ControlRig.ControlRigControl.OnManipulatingChanged
// 0x0001 (0x0001 - 0x0000)
struct ControlRigControl_OnManipulatingChanged final
{
public:
	bool                                          bIsManipulating;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ControlRig.ControlRigControl.OnSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct ControlRigControl_OnSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ControlRig.ControlRigControl.OnTransformChanged
// 0x0030 (0x0030 - 0x0000)
struct ControlRigControl_OnTransformChanged final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function ControlRig.ControlRigComponent.BP_GetControlRig
// 0x0008 (0x0008 - 0x0000)
struct ControlRigComponent_BP_GetControlRig final
{
public:
	class UControlRig*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

