#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: OstrichReticle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OstrichReticle.OstrichReticle_C
// 0x0020 (0x02B8 - 0x0298)
class UOstrichReticle_C final : public UOstrichReticleDecorator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_MissleReticle;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Default_Number_Rockets;                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UMaterialInstanceDynamic*               ReticleMID;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OstrichReticle(int32 EntryPoint);
	void OnSetupComplete();
	void Construct();
	void RocketCooldown(float Percent);
	void RocketLoaded(float Percent, int32 Total);
	void RocketsFired();
	void ShotgunReload(float Duration);

	float GetGunnerRocketMax() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OstrichReticle_C">();
	}
	static class UOstrichReticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOstrichReticle_C>();
	}
};

}

