#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ScreenCapture

#include "Basic.hpp"


namespace SDK::Params
{

// Function ScreenCapture.ScreenCaptureContext.CreateScreenCaptureContext
// 0x0010 (0x0010 - 0x0000)
struct ScreenCaptureContext_CreateScreenCaptureContext final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScreenCaptureContext*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScreenCapture.ScreenCaptureContext.RemoveFile
// 0x0018 (0x0018 - 0x0000)
struct ScreenCaptureContext_RemoveFile final
{
public:
	class FString                                 LocalFilePath;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ScreenCapture.ScreenCaptureContext.SaveToAlbum
// 0x0018 (0x0018 - 0x0000)
struct ScreenCaptureContext_SaveToAlbum final
{
public:
	class FString                                 LocalFilePath;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// Function ScreenCapture.ScreenCaptureContext.StartCapture
// 0x0002 (0x0002 - 0x0000)
struct ScreenCaptureContext_StartCapture final
{
public:
	bool                                          bInRecordAppAudio;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGeneratePreviewImage;                             // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScreenCapture.ScreenCaptureContext.StopCapture
// 0x0001 (0x0001 - 0x0000)
struct ScreenCaptureContext_StopCapture final
{
public:
	bool                                          bIsCaptureInterrupted;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScreenCapture.ScreenCaptureContext.ToggleMicrophoneRecording
// 0x0001 (0x0001 - 0x0000)
struct ScreenCaptureContext_ToggleMicrophoneRecording final
{
public:
	bool                                          bEnableMicrophone;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function ScreenCapture.ScreenCaptureContext.IsRecording
// 0x0001 (0x0001 - 0x0000)
struct ScreenCaptureContext_IsRecording final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

